# Второй раунд. Решение задач на Java.

Во второй раунд попадают лучшие 90% участников первого раунда.

Во втором раунде Участникам предстоит написать и загрузить на Платформу программный код, решающий различные алгоритмические задачи. Результат выполнения кода автоматически проверяется Платформой на совпадение с ожидаемым (известным заранее) результатом.

За каждый успешно пройденный тест Участник получает баллы в соответствии со сложностью задачи. Штрафы за потраченное время и за количество попыток не предусмотрены. Однако максимальное количество попыток решения каждой из задач ограничено в зависимости от сложности задачи.

На решение всех пяти заданий вам отводятся 4 часа. Полные описания заданий станут доступны 29 августа в 15:00 по МСК. В 19:00 загрузка решений становится недоступной. Задачи можно решать в любом порядке.

Задачи загружаются в виде одного .java файла с исходным кодом. Входные данные поступают на stdin, выходные выводятся на stdout.

Пример программы, суммирующей два целых числа и выводящей сумму:

```java
import java.util.Scanner;

public class Main {
public static void main(String[] args) {
Scanner scan = new Scanner(System.in);
int a = scan.nextInt();
int b = scan.nextInt();

        System.out.print(a + b);
    }
}
```

---

[Список задач][problems]:
- A. Плинтус [Условие][problemA] [Решение][solutionA]
- B. Коробки [Условие][problemB] [Решение][solutionB]
- C. Группировки [Условие][problemC] [Решение][solutionC]
- D. Дефектный XML [Условие][problemD] [Решение][solutionD]
- E. Автоматическая торговля [Условие][problemE] [Решение][solutionE]

***

[//]: <> (All links)

[problemA]: ./Problems/A.%20Плинтус.pdf
[problemB]: ./Problems/B.%20Коробки.pdf
[problemC]: ./Problems/C.%20Группировки.pdf
[problemD]: ./Problems/D.%20Дефектный%20XML.pdf
[problemE]: ./Problems/E.%20Автоматическая%20торговля.pdf
[problems]: ./Problems/Problems.pdf

[solutionA]: ./A/src/SkirtingBoard.java
[solutionB]: ./B/src/Boxes.java
[solutionC]: ./C/src/Groupings.java
[solutionD]: ./D/src/DefectiveXML.java
[solutionE]: ./E/src/AutomaticTrading.java


